/* Имя оператора по умолчанию, если не подгрузилась информация */
"agent_name_default" = "Agent";

/* Надпись к сообщениям клиента */
"agent_name_you" = "You";

"Agent.DisplayName.Deleted" = "Deleted agent";

/* Normally user iOS device doesn't return "Restricted" camera access status. But for test purposes we've added an alert with this string message anyway. */
"Camera.Access.Restricted" = "Camera access denied";

"Camera.Access.Suggestion" = "We need your permission to be able to take photos and share them";

/* Alert with this message displays when you try to take a photo from camera on iOS simulator or when real device experiencing some technical issues. */
"Camera.Access.Unavailable" = "Camera is unavailable";

"chat_input.status.contact_info" = "Fill the contact form above";

/* Подзаголовок окна чата по умолчанию */
"chat_subtitle_placeholder" = "Chat with us 24/7!";

/* Системное сообщение в ленте чата, говорящее о том, что произошел разрыв соединения  с сервером. */
"chat_system_disconnected" = "Network error code: %d, error message: %s";

/* Системное сообщение в ленте чата, говорящее о том, что в данный момент несколько агентов набирают сообщение. */
"chat_system_few_agents_typing" = "%s, %s and +%d are typing...";

/* Системное сообщение в ленте чата, говорящее о том, что в данный момент один агент набирает сообщение. */
"chat_system_one_agent_typing" = "%s is typing...";

/* Системное сообщение в ленте чата, говорящее о том, что в данный момент два агента набирают сообщение. */
"chat_system_two_agents_typing" = "%s and %s are typing...";

/* Заголовок окна чата по умолчанию */
"chat_title_placeholder" = "Report an issue";

"chat.state_unavailable.discription" = "Live chat is temporarily unavailable at the moment. Please try again later.";

"chat.state_unavailable.title" = "Chat is temporarily unavailable";

"chat.system.contact_form.introduce_in_chat" = "Please introduce yourself in chat";

"chat.system.contact_form.must_fill" = "Please fill in your contact information to send this message";

"chat.system.contact_form.status_sent" = "Your message is being sent over to the team. They'll be in touch soon. ";

"Chat.System.Media.Preparing" = "Preparing the file...";

"Chat.System.Media.Uploading" = "Sending the file...";

"Chat.System.NewMessages" = "New messages";

"Client.Title" = "Client #%d";

/* Общая строка "Отмена" */
"common_cancel" = "Cancel";

"common_close" = "Close";

"common_done" = "Done";

/* Универсальное сообщение о неизвестной ошибке. */
"common_unknown_error" = "Unknown error";

"Common.Open" = "Open";

"common.send" = "Send";

/* Состояние подключения к сервису */
"connection_state_connecting" = "Connecting…";

/* Состояние отсутствия подключения */
"connection_state_disconnected" = "Connection failed, retry in %d seconds";

/* Кнопка для повторного подключения к сервису, не дожидаясь таймаута  */
"connection_state_retry" = "Retry immediately";

"contact_form.email.placeholder" = "Your email";

"contact_form.name.placeholder" = "Your name";

"contact_form.phone.placeholder" = "Your phone";

"contact_form.status.sent" = "Thank you!";

/* Статус загрузки - ошибка */
"download_status_error" = "Error";

/* Статус загрузки - загрузка */
"download_status_loading" = "Uploading...";

/* Ошибка загрузки файла, если ссылка устарела. */
"file_download_expired" = "Link has expired";

/* Message letting user know that file is unavailable for download. */
"file_download_unavailable" = "File not available";

/* Проверка ссылки на файл */
"file_link_checking" = "Checking...";

/* Default file name */
"file_name_unknown" = "Untitled file";

"file_transfer_disabled" = "File transfer disabled";

/* Формат для размера файла в байтах */
"format_file_size_b" = "%.0f B";

/* Формат для размера файла в килобайтах */
"format_file_size_kb" = "%.0f KB";

/* Формат для размера файла в мегабайтах */
"format_file_size_mb" = "%.2f MB";

/* Подсказка в окне ввода сообщения */
"input_message_placeholder" = "Type your message...";

"jivo_business_messenger" = "Business Messenger by";

/* Надпись на кнопке контекстного меню выбора типа вложения. Нажатие на кнопку открывает системный пикер документов. */
"media_upload_attachment_type_selecting_document" = "Document";

/* Надпись на кнопке контекстного меню выбора типа вложения. Нажатие на кнопку вызывает пикер фотогалереи. */
"media_upload_attachment_type_selecting_photo" = "Photo";

/* Заголовок с вопросом о том, какой тип вложения пользователь хочет прикрепить к сообщению. */
"media_upload_select_an_attachment_type_title" = "What would you like to attach?";

/* Системное сообщение в ленте чата, говорящее о том, что в данный момент ведётся загрузка файла на сервер. */
"media_upload_sending_the_file" = "Sending the file";

"media_uploading_common_error" = "Failed to upload the file";

/* Ошибка, возникающая при неудачной подготовке файла к загрузке. */
"media_uploading_extraction_error" = "Failed to prepare the file";

/* Превышение лимита выгружаемого файла */
"media_uploading_too_large" = "File size must not exceed %dMB";

"Media.Access.Missing" = "Please Allow Access";

"Media.Access.Suggestion" = "JivoChat needs access to your photo library to send photos and videos.\n\nPlease go to [Settings > Your App > Photos] to give access.";

"Media.Picker.Camera" = "Camera";

/* Пункт меню "Копировать ссылку" */
"menu_action_copy" = "Copy link";

/* Пункт меню "Cкачать" */
"menu_action_download" = "Download";

/* Кнопка скачать для прикрепленного документа/файла */
"message_download" = "Download";

/* Системное сообщение о присоединении оператора к чату */
"message_system_operator_accepted" = "Agent joined the chat";

/* Unsupported file type */
"message_unsupported_media" = "This file type is not supported";

"Message.Deleted" = "Message was deleted";

"Message.Edited" = "(edited)";

"Message.Preview.Line" = "The chat was transferred to the second line";

"Message.Sender.You" = "You";

"messages.label.bot" = "bot";

"notification_channel_message_description" = "Message from Jivo SDK";

"notification_channel_message_name" = "Jivo";

/* Format for text message where $1 is agent name, $2 - text message */
"notification_message_text_format" = "%1$s: %2$s";

"notification_message_title" = "Support";

"offline_message_placeholder" = "Oops, it seems that our agents are not available now. You can leave your message here in chat and they will contact you soon.";

/* Пункт "Копировать" контекстного меню, вызываемого долгим тапом по бабблу сообщения. */
"options_copy" = "Copy";

/* Пункт "Повторить отправку" контекстного меню, вызываемого долгим тапом по бабблу сообщения. */
"options_resend" = "Resend";

/* Normally an alert with this message shouldn't be displayed but for test purposes it was added to SDK anyway., If there is an error then the alert should be displayed on photo library access try when starting to pick images. */
"PhotoLibrary.Access.NoAvailableImages" = "No available images";

/* Normally an alert with this message shouldn't be displayed but for test purposes it was added to SDK anyway */
"PhotoLibrary.Access.Unavailable" = "Photo library is unavailable";

"toast_copied_to_clipboard" = "Copied";

/* Приветственное сообщение для пустого чата */
"welcome_message_placeholder" = "Chat with our customer support team and let us know if there's any bugs we can fix";

